In [1]:
import pandas as pd

In [3]:
d = {'Name':pd.Series(['Ansil','Sherin','Jobin','desmi']),'Age':pd.Series([20,22,23,20]),'Ranking':pd.Series([98,90,80,45])}

In [4]:
df = pd.DataFrame(d)
df

     Name  Age  Ranking
0   Ansil   20       98
1  Sherin   22       90
2   Jobin   23       80
3   desmi   20       45

In [11]:
df.loc[0]

Name       Ansil
Age           20
Ranking       98
Name: 0, dtype: object

In [12]:
df.mean()

C:\Users\ANSIL M B\AppData\Local\Temp\ipykernel_18916\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

Age        21.25
Ranking    78.25
dtype: float64

In [13]:
df.median()

C:\Users\ANSIL M B\AppData\Local\Temp\ipykernel_18916\530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

Age        21.0
Ranking    85.0
dtype: float64

In [14]:
df['Age'].mean()

21.25

In [15]:
df.mode()

     Name   Age  Ranking
0   Ansil  20.0       45
1   Jobin   NaN       80
2  Sherin   NaN       90
3   desmi   NaN       98

In [16]:
df['Age'].mode()

0    20
Name: Age, dtype: int64